;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(disable-packages! helm-mode
                   org-bullets)
(package! auto-async-byte-compile)
(package! feebleline)
(package! show-eol)
(package! ivy-youtube)
(package! anzu)
(package! emms)
(package! emms-mode-line-cycle)
(package! org-caldav)
(package! secretaria)
(package! org-caldav)
(package! mu4e-conversation)
(package! annot :recipe
  (:host github :repo "ghoshi/annot" :files ("src/annot.el")))
(package! pinentry)
(package! eldoc-box)
(package! keyfreq)
(package! auto-capitalize :recipe
  (:host github :repo "yuutayamada/auto-capitalize-el" :files ("auto-capitalize.el")))
(package! deadgrep)
(package! font-lock-studio)
(package! mentor)
(package! forecast)
(package! super-save :recipe
  (:host github :repo "bbatsov/super-save" :files ("super-save.el")
         :no-byte-compile t))
(package! howm)
(package! lsp-haskell)
(package! mu4e-alert)
(package! tldr)
(package! disk-usage)
(package! speed-type)
(package! spray)
(package! md4rd)
(package! fireplace)
(package! faith)
(package! jumblr)
(package! gnugo)
(package! key-quiz)
(package! binarytrainer :recipe
  (:host github :repo "elimik31/binarytrainer" :files ("binarytrainer.el")))
(package! malyon)
(package! fireplace)
(package! disk-usage)
(package! spray)
(package! cl-format)
(package! agda-mode :built-in t)
(package! ebdb)
(package! bbdb)
(package! emacs-application-framework :recipe
  (:host github :repo "manateelazycat/emacs-application-framework" :files ("*")))
(package! helm-mu)
(package! counsel-org-clock)
(package! w3m)
(package! anzu)
(package! wiki-summary)
(package! synosaurus)
(package! wordnut)
(package! page-break-lines)
(package! exwm-mff)
(package! company-posframe)
(package! company-quickhelp)
(package! org-tanglesync)
(package! org-ql)
(package! org-sidebar)
(package! orly :recipe
  (:host github :repo "abo-abo/orly" :files ("*")))
(package! company-org-block :recipe
  (:host github :repo "xenodium/dotsies"
                   :files ("emacs/ar/company-org-block.el")))
(package! org-autolist)
(package! org-bookmark-heading)
(package! org-entry-links :recipe
  (:host github :repo "akirak/org-entry-links" :files ("*")))
(package! counsel-org-capture-string :recipe
  (:host github :repo "akirak/counsel-org-capture-string" :files ("*")))
(package! ace-link)
(package! el-patch)
(package! memoize :recipe
  (:host github :repo "skeeto/emacs-memoize" :files ("*")))
(package! elsa)
(package! flycheck-elsa)
(package! cider)
(package! helm-systemd)
(package! org-make-toc)
(package! org-msg)
(package! htmlize)
(package! org-bookmark-heading)
(package! aggressive-indent)
(package! dired-a)
(package! ranger)
(package! enwc)
(package! proced)
(package! bluetooth)
(package! motion-and-kill-dwim)
(package! org-noter)
(package! org-preview-html)
(package! bbdb-vcard)
(package! lozenge :recipe
  (:host github :repo "Kungsgeten/lozenge.el" :files ("*")))
(package! xmlgen)
(package! arduino-mode)
(package! calfw-cal)
(package! calfw-ical)
(package! calfw-howm)
(package! org-sticky-header)
(package! cdlatex)
(package! vterm :built-in t)
(package! typo)
(package! doct :recipe
  (:host github :repo "progfolio/doct" :files ("*")))
(package! direnv)
(package! org-graph-view :recipe
  (:host github :repo "alphapapa/org-graph-view" :files ("*")))
(package! elcord)
(package! sunrise-commander)
(package! perfect-margin)
